app/views/cities/show.html.erb

SELECT  "rooms".* FROM "rooms" INNER JOIN "city_room_relations" ON "rooms"."id" = "city_room_relations"."room_id" WHERE "city_room_relations"."city_id" = ? ORDER BY "rooms"."id" ASC LIMIT ? OFFSET ?  [["city_id", 1], ["LIMIT", 1], ["OFFSET", 1]]
---

<% @city.rooms.each do |e| %>